In [110]:
import os
import pandas as pd
import numpy as np

In [121]:
# Create an DataFrame
df = pd.DataFrame({'ID' : pd.Series([], dtype='int16'),
                   'NAME' : pd.Series([], dtype='str'),
                   'AGE' : pd.Series([], dtype='int16')})

In [122]:
df.dtypes

ID       int16
NAME    object
AGE      int16
dtype: object

In [123]:
#insert rows
df = df.append({'ID': 1, 'NAME': 'XXX', 'AGE': 29}, ignore_index=True)

In [124]:
#another way of inserting rows
df = pd.concat([df, pd.DataFrame({'ID': [2], 'NAME': ['YYY'], 'AGE': [30]})], ignore_index=True)

In [125]:
df = df.append({'ID': 3, 'NAME': 'ZZZ', 'AGE': 35}, ignore_index=True)

In [126]:
df = pd.concat([df, pd.DataFrame({'ID': [4, 5], 'NAME': ['AAA', 'BBB'], 'AGE': [50,32]})], ignore_index=True)

In [127]:
df

   ID NAME  AGE
0   1  XXX   29
1   2  YYY   30
2   3  ZZZ   35
3   4  AAA   50
4   5  BBB   32

In [129]:
#add a new column salary
df['SALARY'] = ""

In [136]:
#update Salary
for i in df.index:
    df.loc[i, 'SALARY'] = df.loc[i]['AGE'] * 50

In [137]:
df

   ID NAME  AGE SALARY
0   1  XXX   29   1450
1   2  YYY   30   1500
2   3  ZZZ   35   1750
3   4  AAA   50   2500
4   5  BBB   32   1600

In [138]:
df.dtypes

ID         int64
NAME      object
AGE        int64
SALARY    object
dtype: object

In [155]:
#change dtype od salary column
df = df.astype({'SALARY': int})

In [158]:
#delete ID column
del df['ID']

In [165]:
#truncate dataframe
df = df.truncate(after=-1)

In [166]:
df

Empty DataFrame
Columns: [NAME, AGE, SALARY]
Index: []

In [167]:
#drop dataframe
del df